{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-1-4be36c486322>\u00da\b<lambda>y\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_11", "function_type": "lambda", "batch_input_shape": [null, 64, 160, 3], "output_shape": null}}, {"class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "trainable": true, "function_type": "lambda", "name": "lambda_12", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0014S)\u0002N\u00e9\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001e<ipython-input-1-4be36c486322>\u00da\b<lambda>|\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "nb_filter": 10, "trainable": true, "init": "he_normal", "nb_col": 1, "name": "convolution2d_41", "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "nb_row": 1, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_11", "alpha": 0.48, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "nb_filter": 3, "trainable": true, "init": "he_normal", "nb_col": 1, "name": "convolution2d_42", "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "nb_row": 1, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_12", "alpha": 0.48, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "maxpooling2d_16", "strides": [2, 3], "pool_size": [2, 3]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "nb_filter": 32, "trainable": true, "init": "he_normal", "nb_col": 5, "name": "convolution2d_43", "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "nb_row": 5, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_31", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "nb_filter": 32, "trainable": true, "init": "he_normal", "nb_col": 5, "name": "convolution2d_44", "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "nb_row": 5, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_32", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "maxpooling2d_17", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "nb_filter": 64, "trainable": true, "init": "he_normal", "nb_col": 3, "name": "convolution2d_45", "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_33", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "nb_filter": 64, "trainable": true, "init": "he_normal", "nb_col": 3, "name": "convolution2d_46", "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "nb_row": 3, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_34", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "maxpooling2d_18", "strides": [2, 4], "pool_size": [2, 4]}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "nb_filter": 256, "trainable": true, "init": "he_normal", "nb_col": 1, "name": "convolution2d_47", "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "nb_row": 1, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_35", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "p": 0.4}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "bias": true, "nb_filter": 128, "trainable": true, "init": "he_normal", "nb_col": 1, "name": "convolution2d_48", "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "b_regularizer": null, "nb_row": 1, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_36", "alpha": 1.0, "trainable": true}}, {"class_name": "GlobalAveragePooling2D", "config": {"dim_ordering": "tf", "name": "globalaveragepooling2d_6", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "he_normal", "trainable": true, "output_dim": 1, "name": "dense_6", "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "input_dim": 128, "W_constraint": null, "W_regularizer": null, "b_constraint": null}}]}